Adding ePaper status panel
